package com.example.sample;

/**
 * Created by Piotr on 28.05.2016.
 */
public class DistrictsInformation {


   public static final  String locationKey = "AIzaSyDb_4Mu-DA_SrTrhjF52QglCly1fEKOMvk";
   public static final  String nearbyKey = "AIzaSyCMS0PEn6xchJBmV96PZSi4JkH-ZOX2908";
   public static final  String apiKey3 = "AIzaSyCDOBCTduKjHKSDJSGh4A2ZkVkD8vxTg9g";

   //Śródmieście
   public static final String[] dictionaryNames = new String[]{
            "Bemowo",
            "Białołęka",
            "Bielany",
            "Mokotów",
            "Ochota",
            "Praga Południe",
            "Praga Północ",
            "Rembertów",
            "Śródmieście",
            "Targówek",
            "Ursus",
            "Ursynów",
            "Wawer",
            "Wesoła",
            "Wilanów",
            "Włochy",
            "Wola",
            "Żoliborz"};


    public static enum dictionaryIndexes {
        Bemowo,
        Białołęka,
        Bielany,
        Mokotów,
        Ochota,
        Praga_Południe,
        Praga_Północ,
        Rembertów,
        Śródmieście,
        Targówek,
        Ursus,
        Ursynów,
        Wawer,
        Wesoła,
        Wilanów,
        Włochy,
        Wola,
        Żoliborz
    }

    public static String getDistrictFromID(int ID)
    {
       if(ID>=0 && ID<dictionaryNames.length)
           return dictionaryNames[ID];

        return null;
    }


   public static final int [][] timeValues =
            {
                    {0,1246,951,1754,749,1436,1146,1703,1196,1319,865,1243,2202,2427,2209,1057,583,784},
                    {1253,0,829,1985,1270,1437,1064,1538,1409,1109,1532,1910,2306,2428,2230,1641,1104,895},
                    {1111,1042,0,1806,1117,1258,1023,1593,1230,1196,1379,1757,2024,2249,2051,1488,951,727},
                    {1767,1828,1534,0,1109,934,1443,1054,876,1689,1578,1163,1400,1577,1090,1182,1399,1332},
                    {1074,1468,1204,1193,0,875,1339,1346,762,1541,892,1090,1641,1866,1684,431,625,1005},
                    {1508,1484,1190,1128,918,0,995,752,768,1093,1450,1645,1053,1235,1452,1208,1208,988},
                    {1215,1071,923,1550,1212,965,0,1232,950,633,1494,1872,1697,1925,1847,1642,1030,694},
                    {1747,1540,1506,1051,1310,715,1236,0,1126,800,1842,1516,899,1156,1349,1620,1600,1390},
                    {1218,1243,949,902,644,588,806,1024,0,1032,1098,1425,1320,1547,1378,930,716,650},
                    {1384,1125,1101,1739,1401,1194,799,850,1183,0,1663,2041,1657,1873,2080,1772,1235,1027},
                    {943,1606,1342,1640,876,1480,1506,1951,1258,1679,0,1073,2246,2471,1950,798,901,1143},
                    {1285,1948,1684,1121,1115,1431,1848,1503,1457,2021,1051,0,1849,2026,1324,837,1140,1485},
                    {2231,2207,1913,1439,1641,1134,1663,894,1457,1678,2173,1904,0,1035,1737,1931,1931,1711},
                    {2377,2353,2059,1527,1787,1215,1809,1055,1603,1839,2319,1992,1037,0,1825,2096,2077,1857},
                    {2151,2127,1833,1144,1585,1260,1724,1357,1409,1988,1813,1344,1704,1880,0,1448,1875,1631},
                    {982,1645,1381,1195,501,1109,1545,1580,996,1718,717,737,1875,2100,1496,0,807,1182},
                    {615,1059,795,1556,523,1238,959,1515,911,1132,943,1232,2004,2229,2053,894,0,596},
                    {849,846,615,1428,866,880,617,1303,705,902,1128,1506,1646,1871,1673,1237,700,0}
            };

}
